app/Models/ContactModel.php

SELECT *
FROM `Contacts`
---
    public function getContact($id = null)
    {
        // TODO don't need the $id - always returns all in the final app
        if ($id === null) {
            return $this->findAll();

UPDATE `Contacts` SET `first_name` = 'Moira', `middle_name` = 'Phoebe', `last_name` = 'Skinner', `date_of_birth` = '1986-12-04', `address` = '17 Tin Lane, Durham', `postcode` = 'DU2 4TG', `telephone_number` = '07513 647931', `email` = 'moira@tinlane.co.uk', `active` = 1
WHERE `contact_id` = 'undefined'
---
    public function updateContact($id = null, $contact = null) {

        // Connect to database
        $db = db_connect();

        // Gather values
        $data = [
            'first_name' => $contact->first_name,
            'middle_name' => $contact->middle_name,
            'last_name' => $contact->last_name,
            'date_of_birth' => $contact->date_of_birth,
            'address' => $contact->address,
            'postcode' => $contact->postcode,
            'telephone_number' => $contact->telephone_number,
            'email' => $contact->email,
            'active' => $contact->active
        ];


        // Run the Query
        try {
            $db->table('Contacts')->update($data, ['contact_id' => $id]);

INSERT INTO `Contacts` (`first_name`, `middle_name`, `last_name`, `date_of_birth`, `address`, `postcode`, `telephone_number`, `email`, `active`) VALUES ('Harriet', 'Catherine', 'Rogers', '1998-05-12', 'Manor House, Ottery St Mary', 'EX19 3ER', '01375 634972', 'rogers@ottery.co.uk', 1)
---
    public function addContact($contact = null) {
        // Connect to the database
        $db = db_connect();

        $data = [
                    'first_name' => $contact->first_name,
                    'middle_name' => $contact->middle_name,
                    'last_name' => $contact->last_name,
                    'date_of_birth' => $contact->date_of_birth,
                    'address' => $contact->address,
                    'postcode' => $contact->postcode,
                    'telephone_number' => $contact->telephone_number,
                    'email' => $contact->email,
                    'active' => $contact->active
        ];

        // Run the Query
        try {
            $db->table('Contacts')->insert($data);